## Pandas

In [1]:
import pandas as pd

Series & Data Frame

series - 1D

Data Frame - 2D

A pandas series is like a column in table.

its a one = dimenional array holding data of any type

In [2]:
# Series method

series = pd.Series([1, 2, 7, 8, 5])
print(series)

0    1
1    2
2    7
3    8
4    5
dtype: int64

In [5]:
# Series method with Index

series1 = pd.Series([1, 7, 2, 8, 5], index = ['a', 'b', 'c', 'd', 'e'])
print(series1)

a    1
b    7
c    2
d    8
e    5
dtype: int64

In [9]:
#Accessing Series elements

print(series[1])
print(series1['d'])

2
8

DataFrame -  A DAta frame is a two dimensional data structure, i.e, data is aligned in a tabular fashion in rows and columns.

In [10]:
#DataFrame method on list

data = pd.DataFrame([1, 2, 3, 4, 5])
print(data)

   0
0  1
1  2
2  3
3  4
4  5

In [16]:
#DataFrame using Dictionary

data1 = pd.DataFrame({'Name':[ 'Tom', 'Jack', 'Steve', 'Ricky', 'Sam', 'Will', 'Root'],
                      'Age':[ 23, 34, 29, 42, 17, 17, 45]})

In [17]:
data1.head()

    Name  Age
0    Tom   23
1   Jack   34
2  Steve   29
3  Ricky   42
4    Sam   17

In [18]:
data1.shape

(7, 2)

In [19]:
data2 = pd.DataFrame({'Name':[ 'Tom', 'Jack', 'Steve', 'Ricky', 'Sam', 'Will', 'Root'],
                      'Age':[ 23, 34, 29, 42, 17, 17, 45]}, index = ['c1', 'c2', 'c3','c4', 'c5', 'c6','c7'])
data2.head(10)

     Name  Age
c1    Tom   23
c2   Jack   34
c3  Steve   29
c4  Ricky   42
c5    Sam   17
c6   Will   17
c7   Root   45

In [21]:
#column Selection

data2['Name']

c1      Tom
c2     Jack
c3    Steve
c4    Ricky
c5      Sam
c6     Will
c7     Root
Name: Name, dtype: object

In [22]:
data2['Age']

c1    23
c2    34
c3    29
c4    42
c5    17
c6    17
c7    45
Name: Age, dtype: int64

In [24]:
# Row Selection

data2.loc['c1','Name']

'Tom'

In [27]:
data2.iloc[2,0]

'Steve'

Pandas Concatemation

it is used to concatenate pandas objects along a particular axies with optional set logic along the other axes.

In [29]:
names = pd.DataFrame({'Name':[ 'Tom', 'Jack', 'Steve', 'Ricky', 'Sam', 'Will', 'Root']})
ages = pd.DataFrame({'Age':[ 23, 34, 29, 42, 17, 17, 45]})

In [30]:
name2 = pd.DataFrame({'Name':['Joe', 'Pope', 'Buttler', ' Ben', 'James', 'Cook']})

In [31]:
names

    Name
0    Tom
1   Jack
2  Steve
3  Ricky
4    Sam
5   Will
6   Root

In [32]:
ages

   Age
0   23
1   34
2   29
3   42
4   17
5   17
6   45

In [33]:
pd.concat([names, ages], axis = 1)

    Name  Age
0    Tom   23
1   Jack   34
2  Steve   29
3  Ricky   42
4    Sam   17
5   Will   17
6   Root   45

In [34]:
name2

      Name
0      Joe
1     Pope
2  Buttler
3      Ben
4    James
5     Cook

In [35]:
pd.concat([names, name2],axis = 0)

      Name
0      Tom
1     Jack
2    Steve
3    Ricky
4      Sam
5     Will
6     Root
0      Joe
1     Pope
2  Buttler
3      Ben
4    James
5     Cook

In [36]:
pd.concat([names, name2],axis = 0).reset_index()

    index     Name
0       0      Tom
1       1     Jack
2       2    Steve
3       3    Ricky
4       4      Sam
5       5     Will
6       6     Root
7       0      Joe
8       1     Pope
9       2  Buttler
10      3      Ben
11      4    James
12      5     Cook

Filtering

In [39]:
data3 = pd.DataFrame({'Name':[ 'Tom', 'Jack', 'Steve', 'Ricky', 'Sam', 'Will', 'Root'],
                      'Age':[ 23, 34, 29, 42, 17, 17, 45]}, index = ['c1', 'c2', 'c3','c4', 'c5', 'c6','c7'])

In [40]:
data3

     Name  Age
c1    Tom   23
c2   Jack   34
c3  Steve   29
c4  Ricky   42
c5    Sam   17
c6   Will   17
c7   Root   45

In [44]:
data3[data3['Age'] <= 18][['Name']]

    Name
c5   Sam
c6  Will

pandas Creating & Reading CSV files

In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame({ 'Name' : ['Ankit', ' Aishwarya', 'Sanket', 'Shivangi', 'Saiprasad', 'Rishika', 'Pratiksha'],
                     'Age' : [23, 21, 22, 21, 22, 21, 20],
                     'University' : [ 'BHU', 'JNU', 'DU', 'BHU', 'SPPU', 'SPPU', 'DU'] })

In [5]:
df

         Name  Age University
0       Ankit   23        BHU
1   Aishwarya   21        JNU
2      Sanket   22         DU
3    Shivangi   21        BHU
4   Saiprasad   22       SPPU
5     Rishika   21       SPPU
6   Pratiksha   20         DU

In [6]:
df.to_csv('Students.csv')

In [8]:
new_data = pd.read_csv('Students.csv')

In [9]:
new_data.head()

   Unnamed: 0        Name  Age University
0           0       Ankit   23        BHU
1           1   Aishwarya   21        JNU
2           2      Sanket   22         DU
3           3    Shivangi   21        BHU
4           4   Saiprasad   22       SPPU

In [14]:
df.to_csv('Student_1.csv', index = False)

In [15]:
new_data_1 = pd.read_csv('Student_1.csv')

In [16]:
new_data_1.head()

         Name  Age University
0       Ankit   23        BHU
1   Aishwarya   21        JNU
2      Sanket   22         DU
3    Shivangi   21        BHU
4   Saiprasad   22       SPPU

Uploading Datasets

In [17]:
df_1 = pd.read_csv('E:\hari\TwiLearn\LEARNING\Students.csv')

In [18]:
df_1.head()

   Unnamed: 0        Name  Age University
0           0       Ankit   23        BHU
1           1   Aishwarya   21        JNU
2           2      Sanket   22         DU
3           3    Shivangi   21        BHU
4           4   Saiprasad   22       SPPU

Groupby Function

In [19]:
df_2 = pd.read_csv('Student_1.csv')

In [20]:
df_2.head()

         Name  Age University
0       Ankit   23        BHU
1   Aishwarya   21        JNU
2      Sanket   22         DU
3    Shivangi   21        BHU
4   Saiprasad   22       SPPU

In [ ]:
df_2

#### Top commands

Creating new,Renaming & Droping Columns.
Apply Method, Sort Index, Sort Values

In [21]:
df_3 = pd.read_csv('Student_1.csv')

In [22]:
df_3.head()

         Name  Age University
0       Ankit   23        BHU
1   Aishwarya   21        JNU
2      Sanket   22         DU
3    Shivangi   21        BHU
4   Saiprasad   22       SPPU

In [23]:
# Creating new columns

df_3['City'] = ['Delhi', 'Bangalore', 'Chennai', 'Patna', 'Pune', 'Pune', 'Mumbai']

In [24]:
df_3.head()

         Name  Age University       City
0       Ankit   23        BHU      Delhi
1   Aishwarya   21        JNU  Bangalore
2      Sanket   22         DU    Chennai
3    Shivangi   21        BHU      Patna
4   Saiprasad   22       SPPU       Pune

In [25]:
# Rename columns

df_3.columns = ['Name'.upper(), 'Age'.upper(), 'Univerity'.upper(), 'city'.upper()]

In [26]:
df_3.head()

         NAME  AGE UNIVERITY       CITY
0       Ankit   23       BHU      Delhi
1   Aishwarya   21       JNU  Bangalore
2      Sanket   22        DU    Chennai
3    Shivangi   21       BHU      Patna
4   Saiprasad   22      SPPU       Pune

In [28]:
# Drop columns

df_3.drop(['AGE'], axis = 1) # it is only for temporary drop

         NAME UNIVERITY       CITY
0       Ankit       BHU      Delhi
1   Aishwarya       JNU  Bangalore
2      Sanket        DU    Chennai
3    Shivangi       BHU      Patna
4   Saiprasad      SPPU       Pune
5     Rishika      SPPU       Pune
6   Pratiksha        DU     Mumbai

In [29]:
df_3.drop(['AGE'], axis = 1, inplace = True)    # permenent drop

In [30]:
df_3

         NAME UNIVERITY       CITY
0       Ankit       BHU      Delhi
1   Aishwarya       JNU  Bangalore
2      Sanket        DU    Chennai
3    Shivangi       BHU      Patna
4   Saiprasad      SPPU       Pune
5     Rishika      SPPU       Pune
6   Pratiksha        DU     Mumbai

Apply Method

In [31]:
# Creating Mark columns

In [32]:
df_3['Mark'.upper()] = [201, 210, 195, 183, 225, 203, 190]

In [33]:
df_3

         NAME UNIVERITY       CITY  MARK
0       Ankit       BHU      Delhi   201
1   Aishwarya       JNU  Bangalore   210
2      Sanket        DU    Chennai   195
3    Shivangi       BHU      Patna   183
4   Saiprasad      SPPU       Pune   225
5     Rishika      SPPU       Pune   203
6   Pratiksha        DU     Mumbai   190

In [36]:
# apply Method

df_3['MARK'] = df_3['mark'.upper()].apply(lambda x: x/5)

In [37]:
df_3.head()

         NAME UNIVERITY       CITY  MARK
0       Ankit       BHU      Delhi  40.2
1   Aishwarya       JNU  Bangalore  42.0
2      Sanket        DU    Chennai  39.0
3    Shivangi       BHU      Patna  36.6
4   Saiprasad      SPPU       Pune  45.0

In [38]:
# Rename columns

df_3.columns = ['Name'.upper(), 'Univerity'.upper(), 'city'.upper(), 'marks/ subject'.upper()]

In [39]:
df_3

         NAME UNIVERITY       CITY  MARKS/ SUBJECT
0       Ankit       BHU      Delhi            40.2
1   Aishwarya       JNU  Bangalore            42.0
2      Sanket        DU    Chennai            39.0
3    Shivangi       BHU      Patna            36.6
4   Saiprasad      SPPU       Pune            45.0
5     Rishika      SPPU       Pune            40.6
6   Pratiksha        DU     Mumbai            38.0

Sort Index

In [40]:
df_3.index = [10, 28, 64, 7, 1, 6, 15]

In [41]:
df_3

          NAME UNIVERITY       CITY  MARKS/ SUBJECT
10       Ankit       BHU      Delhi            40.2
28   Aishwarya       JNU  Bangalore            42.0
64      Sanket        DU    Chennai            39.0
7     Shivangi       BHU      Patna            36.6
1    Saiprasad      SPPU       Pune            45.0
6      Rishika      SPPU       Pune            40.6
15   Pratiksha        DU     Mumbai            38.0

In [42]:
df_3.sort_index()

          NAME UNIVERITY       CITY  MARKS/ SUBJECT
1    Saiprasad      SPPU       Pune            45.0
6      Rishika      SPPU       Pune            40.6
7     Shivangi       BHU      Patna            36.6
10       Ankit       BHU      Delhi            40.2
15   Pratiksha        DU     Mumbai            38.0
28   Aishwarya       JNU  Bangalore            42.0
64      Sanket        DU    Chennai            39.0

In [44]:
df_3.sort_index(ascending = False)

          NAME UNIVERITY       CITY  MARKS/ SUBJECT
64      Sanket        DU    Chennai            39.0
28   Aishwarya       JNU  Bangalore            42.0
15   Pratiksha        DU     Mumbai            38.0
10       Ankit       BHU      Delhi            40.2
7     Shivangi       BHU      Patna            36.6
6      Rishika      SPPU       Pune            40.6
1    Saiprasad      SPPU       Pune            45.0

Sort values

In [47]:
df_3.sort_values(by = 'marks/ subject'.upper())

          NAME UNIVERITY       CITY  MARKS/ SUBJECT
7     Shivangi       BHU      Patna            36.6
15   Pratiksha        DU     Mumbai            38.0
64      Sanket        DU    Chennai            39.0
10       Ankit       BHU      Delhi            40.2
6      Rishika      SPPU       Pune            40.6
28   Aishwarya       JNU  Bangalore            42.0
1    Saiprasad      SPPU       Pune            45.0